In [1]:
import numpy as np
import scipy as sc
from matplotlib import pyplot as plt
import pandas as pd
import seaborn as sb

In [2]:
#helpper functions

def load_data(path: str) -> pd.DataFrame:
    return pd.read_csv(path)

def describe_data(df: pd.DataFrame) -> pd.DataFrame:
    print(df.describe(),"\n")
    print(df.info(),"\n")
    print('Duplicated values count:\n',df.duplicated().sum(),"\n")
    print('Not a number values count:\n',df.isna().sum(),"\n")
    print('Missing values rows:')
    df_with_nan = df[df.isna().any(axis=1)]
    display(df_with_nan)
    print('Duplicated values rows:')
    duplicated_indexes = df.duplicated().where(df.duplicated()==True).dropna().index.tolist()
    display(df.loc[duplicated_indexes])

In [3]:
car_ownership = load_data('data/car_ownership.csv')
car_price = load_data('data/car_price_and_metrics.csv')
car_sales = load_data('data/car_sales.csv')

In [4]:
describe_data(car_ownership)

       Credit Score
count    460.000000
mean     702.969565
std       69.232323
min      500.000000
25%      650.000000
50%      700.000000
75%      750.000000
max      900.000000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Occupation           490 non-null    object
 1   Monthly Income       487 non-null    object
 2   Credit Score         460 non-null    float64
 3   Years of Employment  457 non-null    object
 4   Finance Status       477 non-null    object
 5   Finance History      472 non-null    object
 6   Car                  480 non-null    object
 7   Number of Children   375 non-null    object
dtypes: float64(1), object(7)
memory usage: 31.4+ KB
None

Duplicated values count:
 73

Not a number values count:
 Occupation              10
Monthly Income          13
Credit Score            40
Years of Employment     43
Finance Status          23
Finance History         28
Car                     20
Number of Children     125
dtype: int64

Missing values rows:

,Occupation,Monthly Income,Credit Score,Years of Employment,Finance Status,Finance History,Car,Number of Children
6,Teacher,35000,700.0,8,Fair,Late payment 3 months ago,Yes,NaN
7,Nurse,20000,600.0,3,Poor,Late payment 1 month ago,No,NaN
8,Businessman,120000,850.0,20,Excellent,No issues,Yes,NaN
9,Doctor,90000,800.0,10,Good,No issues,Yes,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
476,Pharmacist,"$9,000",780.0,NaN,Stable,No significant issues,Yes,1
477,Writer,"$3,500",650.0,NaN,NaN,NaN,NaN,NaN
478,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
483,Real Estate Agent,"$5,500",690.0,4 years,Stable,NaN,Yes,0
489,Web Developer,"$5,800",690.0,4 years,Stable,NaN,No,1

Duplicated values rows:

,Occupation,Monthly Income,Credit Score,Years of Employment,Finance Status,Finance History,Car,Number of Children
72,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
93,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
134,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
196,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
210,Insurance Agent,"$4,500",690.0,4 years,Stable,No significant issues,Yes,1
...,...,...,...,...,...,...,...,...
456,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
478,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
481,Sales Manager,"$7,500",720.0,6 years,Stable,No significant issues,Yes,2
496,Chef,"$4,500",680.0,4 years,Stable,No significant issues,Yes,0
497,Interior Designer,"$5,500",690.0,4 years,Stable,No significant issues,Yes,1

In [5]:
describe_data(car_price)

              year  selling_price     km_driven  mileage(km/ltr/kg)  \
count  8128.000000   8.128000e+03  8.128000e+03         7907.000000
mean   2013.804011   6.382718e+05  6.981951e+04           19.418783
std       4.044249   8.062534e+05  5.655055e+04            4.037145
min    1983.000000   2.999900e+04  1.000000e+00            0.000000
25%    2011.000000   2.549990e+05  3.500000e+04           16.780000
50%    2015.000000   4.500000e+05  6.000000e+04           19.300000
75%    2017.000000   6.750000e+05  9.800000e+04           22.320000
max    2020.000000   1.000000e+07  2.360457e+06           42.000000

            engine        seats
count  7907.000000  7907.000000
mean   1458.625016     5.416719
std     503.916303     0.959588
min     624.000000     2.000000
25%    1197.000000     5.000000
50%    1248.000000     5.000000
75%    1582.000000     5.000000
max    3604.000000    14.000000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8128 entries, 0 to 8127
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   name                8128 non-null   object
 1   year                8128 non-null   int64
 2   selling_price       8128 non-null   int64
 3   km_driven           8128 non-null   int64
 4   fuel                8128 non-null   object
 5   seller_type         8128 non-null   object
 6   transmission        8128 non-null   object
 7   owner               8128 non-null   object
 8   mileage(km/ltr/kg)  7907 non-null   float64
 9   engine              7907 non-null   float64
 10  max_power           7913 non-null   object
 11  seats               7907 non-null   float64
dtypes: float64(3), int64(3), object(6)
memory usage: 762.1+ KB
None

Duplicated values count:
 1202

Not a number values count:
 name                    0
year                    0
selling_price           0
km_driven               0
fuel                    0
seller_type             0
transmission            0
owner                   0
mileage(km/ltr/kg)    221
engine                221
max_power             215
seats                 221
dtype: int64

Missing values rows:

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner,mileage(km/ltr/kg),engine,max_power,seats
13,Maruti Swift 1.3 VXi,2007,200000,80000,Petrol,Individual,Manual,Second Owner,NaN,NaN,NaN,NaN
31,Fiat Palio 1.2 ELX,2003,70000,50000,Petrol,Individual,Manual,Second Owner,NaN,NaN,NaN,NaN
78,Tata Indica DLS,2003,50000,70000,Diesel,Individual,Manual,First Owner,NaN,NaN,NaN,NaN
87,Maruti Swift VDI BSIV W ABS,2015,475000,78000,Diesel,Dealer,Manual,First Owner,NaN,NaN,NaN,NaN
119,Maruti Swift VDI BSIV,2010,300000,120000,Diesel,Individual,Manual,Second Owner,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
7846,Toyota Qualis Fleet A3,2000,200000,100000,Diesel,Individual,Manual,First Owner,NaN,NaN,NaN,NaN
7996,Hyundai Santro LS zipPlus,2000,140000,50000,Petrol,Individual,Manual,Second Owner,NaN,NaN,NaN,NaN
8009,Hyundai Santro Xing XS eRLX Euro III,2006,145000,80000,Petrol,Individual,Manual,Second Owner,NaN,NaN,NaN,NaN
8068,Ford Figo Aspire Facelift,2017,580000,165000,Diesel,Individual,Manual,First Owner,NaN,NaN,NaN,NaN
8103,Maruti Swift 1.3 VXi,2006,130000,100000,Petrol,Individual,Manual,Second Owner,NaN,NaN,NaN,NaN

Duplicated values rows:

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner,mileage(km/ltr/kg),engine,max_power,seats
291,Hyundai Grand i10 Sportz,2017,450000,35000,Petrol,Individual,Manual,First Owner,18.90,1197.0,82,5.0
296,Maruti Swift VXI,2012,330000,50000,Petrol,Individual,Manual,Second Owner,18.60,1197.0,85.8,5.0
370,Jaguar XE 2016-2019 2.0L Diesel Prestige,2017,2625000,9000,Diesel,Dealer,Automatic,First Owner,13.60,1999.0,177,5.0
371,Lexus ES 300h,2019,5150000,20000,Petrol,Dealer,Automatic,First Owner,22.37,2487.0,214.56,5.0
372,Jaguar XF 2.0 Diesel Portfolio,2017,3200000,45000,Diesel,Dealer,Automatic,First Owner,19.33,1999.0,177,5.0
...,...,...,...,...,...,...,...,...,...,...,...,...
7987,Renault Captur 1.5 Diesel RXT,2018,1265000,12000,Diesel,Individual,Manual,First Owner,20.37,1461.0,108.45,5.0
7988,Maruti Ciaz Alpha Diesel,2019,1025000,32000,Diesel,Individual,Manual,First Owner,28.09,1248.0,88.5,5.0
8117,Maruti Swift Dzire VDI,2015,625000,50000,Diesel,Individual,Manual,First Owner,26.59,1248.0,74,5.0
8126,Tata Indigo CR4,2013,290000,25000,Diesel,Individual,Manual,First Owner,23.57,1396.0,70,5.0
8127,Tata Indigo CR4,2013,290000,25000,Diesel,Individual,Manual,First Owner,23.57,1396.0,70,5.0

In [6]:
describe_data(car_sales)

       Annual Income     Price ($)         Phone
count   2.390600e+04  23906.000000  2.390600e+04
mean    8.308403e+05  28090.247846  7.497741e+06
std     7.200064e+05  14788.687608  8.674920e+05
min     1.008000e+04   1200.000000  6.000101e+06
25%     3.860000e+05  18001.000000  6.746495e+06
50%     7.350000e+05  23000.000000  7.496198e+06
75%     1.175750e+06  34000.000000  8.248146e+06
max     1.120000e+07  85800.000000  8.999579e+06

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23906 entries, 0 to 23905
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_id         23906 non-null  object
 1   Date           23906 non-null  object
 2   Customer Name  23905 non-null  object
 3   Gender         23906 non-null  object
 4   Annual Income  23906 non-null  int64
 5   Dealer_Name    23906 non-null  object
 6   Company        23906 non-null  object
 7   Model          23906 non-null  object
 8   Engine         23906 non-null  object
 9   Transmission   23906 non-null  object
 10  Color          23906 non-null  object
 11  Price ($)      23906 non-null  int64
 12  Dealer_No      23906 non-null  object
 13  Body Style     23906 non-null  object
 14  Phone          23906 non-null  int64
 15  Dealer_Region  23906 non-null  object
dtypes: int64(3), object(13)
memory usage: 2.9+ MB
None

Duplicated values count:
 0

Not a number values count:
 Car_id           0
Date             0
Customer Name    1
Gender           0
Annual Income    0
Dealer_Name      0
Company          0
Model            0
Engine           0
Transmission     0
Color            0
Price ($)        0
Dealer_No        0
Body Style       0
Phone            0
Dealer_Region    0
dtype: int64

Missing values rows:

,Car_id,Date,Customer Name,Gender,Annual Income,Dealer_Name,Company,Model,Engine,Transmission,Color,Price ($),Dealer_No,Body Style,Phone,Dealer_Region
7564,C_CND_007565,11/5/2022,NaN,Male,680000,Saab-Belle Dodge,Dodge,Ram Pickup,DoubleÂ Overhead Camshaft,Auto,Pale White,45000,60504-7114,Hardtop,7203103,Aurora

Duplicated values rows:

Empty DataFrame
Columns: [Car_id, Date, Customer Name, Gender, Annual Income, Dealer_Name, Company, Model, Engine, Transmission, Color, Price ($), Dealer_No , Body Style, Phone, Dealer_Region]
Index: []

In [7]:
clean_car_ownership = car_ownership.__deepcopy__()
clean_car_sales = car_sales.__deepcopy__()
clean_car_price = car_price.__deepcopy__()

In [8]:
clean_car_ownership.drop_duplicates(inplace=True)

In [9]:
clean_car_ownership.dropna(inplace=True, subset=['Occupation'])

In [10]:
clean_car_ownership.drop(columns=['Finance History'], inplace=True)

In [11]:
def clean_numerics(value):
    
    if pd.isna(value) or pd.isnull(value):
        return value
    
    value_str = str(value).lower()
    value_str = ''.join(char for char in value_str if char.isdigit() or char in ['k'])
    
    if value_str == '':
        return np.nan
        
    if 'k' in value_str:
        value_str = value_str.replace('k', '')  
        return float(value_str) * 1000 

    return float(value_str)

clean_car_ownership['Monthly Income'] = clean_car_ownership['Monthly Income'].apply(clean_numerics)
clean_car_ownership['Years of Employment'] = clean_car_ownership['Years of Employment'].apply(clean_numerics)

In [12]:
# work in progress
def fill_nulls_nans_numeric(df: pd.DataFrame, columns: list, group: str, trasform_to_int: bool) -> pd.DataFrame:

    for column in columns:
        df[column] = df.groupby(group)[column].transform(lambda x: x.fillna(x.mean()))
        df[column] = df[column].fillna(value=df[column].median())
    
    if trasform_to_int:
        df[columns] = df[columns].astype(int)
    
    return df

clean_car_ownership = fill_nulls_nans_numeric(clean_car_ownership, ['Monthly Income', 'Credit Score', 'Years of Employment'], "Occupation", True)

In [13]:
clean_car_ownership['Finance Status'].unique()

array(['Good', 'Fair', 'Excellent', 'Poor', nan, 'Stable', 'Unstable',
       'Unknow', 'Unkonw'], dtype=object)

In [14]:
clean_car_ownership['Finance Status'] = clean_car_ownership['Finance Status'].replace({np.nan:'Unknown', 'Unkonw':'Unknown', 'Unknow': 'Unknown'})
clean_car_ownership['Finance Status'].unique()

array(['Good', 'Fair', 'Excellent', 'Poor', 'Unknown', 'Stable',
       'Unstable'], dtype=object)

In [15]:
clean_car_ownership['Car'] = clean_car_ownership['Car'].fillna('No')

In [16]:
clean_car_ownership['Number of Children'] = clean_car_ownership['Number of Children'].replace({'na':np.nan})
clean_car_ownership['Number of Children'] = clean_car_ownership['Number of Children'].replace({np.nan:-1})

In [17]:
clean_car_ownership.to_csv(path_or_buf='../data/clean_data/clean_car_ownership.csv')

In [18]:
clean_car_price = clean_car_price.drop(columns=['mileage(km/ltr/kg)','max_power','engine','seats'])

In [19]:
clean_car_sales = clean_car_sales.drop(columns=['Customer Name'])

In [20]:
describe_data(clean_car_ownership)

       Monthly Income  Credit Score  Years of Employment
count      426.000000    426.000000           426.000000
mean      7446.624413    701.610329             4.352113
std      12159.747035     66.733100             2.453896
min          7.000000    500.000000             1.000000
25%       3500.000000    650.000000             3.000000
50%       4800.000000    695.000000             4.000000
75%       7000.000000    750.000000             6.000000
max     120000.000000    900.000000            20.000000

<class 'pandas.core.frame.DataFrame'>
Index: 426 entries, 0 to 499
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Occupation           426 non-null    object
 1   Monthly Income       426 non-null    int32
 2   Credit Score         426 non-null    int32
 3   Years of Employment  426 non-null    int32
 4   Finance Status       426 non-null    object
 5   Car                  426 non-null    object
 6   Number of Children   426 non-null    object
dtypes: int32(3), object(4)
memory usage: 21.6+ KB
None

Duplicated values count:
 30

Not a number values count:
 Occupation             0
Monthly Income         0
Credit Score           0
Years of Employment    0
Finance Status         0
Car                    0
Number of Children     0
dtype: int64

Missing values rows:

Empty DataFrame
Columns: [Occupation, Monthly Income, Credit Score, Years of Employment, Finance Status, Car, Number of Children]
Index: []

Duplicated values rows:

,Occupation,Monthly Income,Credit Score,Years of Employment,Finance Status,Car,Number of Children
289,Musician,2500,550,1,Unknown,No,-1
297,Mechanic,2500,600,2,Unstable,No,-1
298,Marketing,5200,720,5,Stable,Yes,-1
299,Graphic Designer,3700,680,3,Stable,No,-1
300,Financial Advisor,8500,780,6,Stable,Yes,-1
301,Real Estate Agent,6200,700,4,Stable,Yes,-1
302,Chef,2800,620,1,Unstable,No,-1
303,Engineer,9000,790,7,Stable,Yes,-1
304,Construction Worker,3000,610,3,Unstable,No,-1
305,Designer,4500,700,4,Stable,No,-1
306,Writer,2500,590,1,Unstable,No,-1
307,Web Developer,6000,730,5,Stable,Yes,-1
308,Chef,3500,650,2,Unstable,No,-1
309,Account Manager,5800,720,4,Stable,Yes,-1
310,Financial Analyst,6800,760,5,Stable,Yes,-1
311,Electrician,3200,640,2,Unstable,No,-1
312,Human Resources,4500,690,3,Stable,Yes,-1
313,Plumber,2700,620,1,Unstable,No,-1
314,Social Worker,3600,670,2,Unstable,No,-1
315,Data Scientist,9200,820,6,Good,Yes,-1
316,Chef,3100,650,2,Fair,No,-1
317,Customer Service,2500,600,1,Excellent,No,-1
318,Veterinarian,7000,750,8,Good,Yes,-1
319,Graphic Designer,3500,680,3,Excellent,No,-1
320,Architect,8500,790,7,Excellent,Yes,-1
321,Chef,3200,630,2,Good,No,-1
322,Web Designer,4800,710,4,Excellent,No,-1
339,Customer Service,2500,600,1,Unstable,No,0
351,Dental Hygienist,5000,718,4,Unknown,No,-1
388,Attorney,11000,806,9,Stable,Yes,1

In [21]:
describe_data(clean_car_sales)

       Annual Income     Price ($)         Phone
count   2.390600e+04  23906.000000  2.390600e+04
mean    8.308403e+05  28090.247846  7.497741e+06
std     7.200064e+05  14788.687608  8.674920e+05
min     1.008000e+04   1200.000000  6.000101e+06
25%     3.860000e+05  18001.000000  6.746495e+06
50%     7.350000e+05  23000.000000  7.496198e+06
75%     1.175750e+06  34000.000000  8.248146e+06
max     1.120000e+07  85800.000000  8.999579e+06

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23906 entries, 0 to 23905
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_id         23906 non-null  object
 1   Date           23906 non-null  object
 2   Gender         23906 non-null  object
 3   Annual Income  23906 non-null  int64
 4   Dealer_Name    23906 non-null  object
 5   Company        23906 non-null  object
 6   Model          23906 non-null  object
 7   Engine         23906 non-null  object
 8   Transmission   23906 non-null  object
 9   Color          23906 non-null  object
 10  Price ($)      23906 non-null  int64
 11  Dealer_No      23906 non-null  object
 12  Body Style     23906 non-null  object
 13  Phone          23906 non-null  int64
 14  Dealer_Region  23906 non-null  object
dtypes: int64(3), object(12)
memory usage: 2.7+ MB
None

Duplicated values count:
 0

Not a number values count:
 Car_id           0
Date             0
Gender           0
Annual Income    0
Dealer_Name      0
Company          0
Model            0
Engine           0
Transmission     0
Color            0
Price ($)        0
Dealer_No        0
Body Style       0
Phone            0
Dealer_Region    0
dtype: int64

Missing values rows:

Empty DataFrame
Columns: [Car_id, Date, Gender, Annual Income, Dealer_Name, Company, Model, Engine, Transmission, Color, Price ($), Dealer_No , Body Style, Phone, Dealer_Region]
Index: []

Duplicated values rows:

Empty DataFrame
Columns: [Car_id, Date, Gender, Annual Income, Dealer_Name, Company, Model, Engine, Transmission, Color, Price ($), Dealer_No , Body Style, Phone, Dealer_Region]
Index: []

In [22]:
describe_data(clean_car_price)

              year  selling_price     km_driven
count  8128.000000   8.128000e+03  8.128000e+03
mean   2013.804011   6.382718e+05  6.981951e+04
std       4.044249   8.062534e+05  5.655055e+04
min    1983.000000   2.999900e+04  1.000000e+00
25%    2011.000000   2.549990e+05  3.500000e+04
50%    2015.000000   4.500000e+05  6.000000e+04
75%    2017.000000   6.750000e+05  9.800000e+04
max    2020.000000   1.000000e+07  2.360457e+06

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8128 entries, 0 to 8127
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           8128 non-null   object
 1   year           8128 non-null   int64
 2   selling_price  8128 non-null   int64
 3   km_driven      8128 non-null   int64
 4   fuel           8128 non-null   object
 5   seller_type    8128 non-null   object
 6   transmission   8128 non-null   object
 7   owner          8128 non-null   object
dtypes: int64(3), object(5)
memory usage: 508.1+ KB
None

Duplicated values count:
 1203

Not a number values count:
 name             0
year             0
selling_price    0
km_driven        0
fuel             0
seller_type      0
transmission     0
owner            0
dtype: int64

Missing values rows:

Empty DataFrame
Columns: [name, year, selling_price, km_driven, fuel, seller_type, transmission, owner]
Index: []

Duplicated values rows:

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
291,Hyundai Grand i10 Sportz,2017,450000,35000,Petrol,Individual,Manual,First Owner
296,Maruti Swift VXI,2012,330000,50000,Petrol,Individual,Manual,Second Owner
370,Jaguar XE 2016-2019 2.0L Diesel Prestige,2017,2625000,9000,Diesel,Dealer,Automatic,First Owner
371,Lexus ES 300h,2019,5150000,20000,Petrol,Dealer,Automatic,First Owner
372,Jaguar XF 2.0 Diesel Portfolio,2017,3200000,45000,Diesel,Dealer,Automatic,First Owner
...,...,...,...,...,...,...,...,...
7987,Renault Captur 1.5 Diesel RXT,2018,1265000,12000,Diesel,Individual,Manual,First Owner
7988,Maruti Ciaz Alpha Diesel,2019,1025000,32000,Diesel,Individual,Manual,First Owner
8117,Maruti Swift Dzire VDI,2015,625000,50000,Diesel,Individual,Manual,First Owner
8126,Tata Indigo CR4,2013,290000,25000,Diesel,Individual,Manual,First Owner
8127,Tata Indigo CR4,2013,290000,25000,Diesel,Individual,Manual,First Owner